meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "РОФЛ": "шутка",
            "ЩИЩ": "одобрение или восторг",
            "КРИПОВЫЙ": "страшный, пугающий",
            "АГРИТЬСЯ":"злиться",
            }
while True:
    word = input("Введите непонятное слово или стоп для отсановки (большими буквами!): ")
    if word in meme_dict.keys():
        print(meme_dict[word])
    elif word == "СТОП":
        break 
    else:
        print("извините но тот кто сказал это явно не человек")
